; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_6_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 - counter
	)
  (:init
		(= (value c0) 42)
	(= (value c1) 32)
	(= (value c2) 62)
	(= (value c3) 37)
	(= (value c4) 14)
	(= (value c5) 87)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
		)
	)
)

; plan
1. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 2 of 5
2. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 2 of 5
3. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 2 of 5
4. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 2 of 5
5. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 2 of 5
6. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 2 of 5
7. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 5
8. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 5
9. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 5
10. (decrement_rate c3)
   changed: (rate_value c3) from 1 to 0
   goals met: 2 of 5
11. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 2 of 5
12. (increment c1)
   changed: (value c1) from 32 to 35
   goals met: 2 of 5
13. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 2 of 5
14. (increment c1)
   changed: (value c1) from 35 to 39
   goals met: 2 of 5
15. (increment c1)
   changed: (value c1) from 39 to 43
   goals met: 3 of 5
16. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 3 of 5
17. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 3 of 5
18. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 3 of 5
19. (increment c4)
   changed: (value c4) from 14 to 20
   goals met: 3 of 5
20. (increment c4)
   changed: (value c4) from 20 to 26
   goals met: 3 of 5
21. (increment c4)
   changed: (value c4) from 26 to 32
   goals met: 3 of 5
22. (increment c4)
   changed: (value c4) from 32 to 38
   goals met: 4 of 5
23. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 5
24. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 5
25. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 5
26. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 5
27. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 4 of 5
28. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 5
29. (increment c3)
   changed: (value c3) from 37 to 43
   goals met: 3 of 5
30. (increment c4)
   changed: (value c4) from 38 to 44
   goals met: 4 of 5
31. (increment c3)
   changed: (value c3) from 43 to 49
   goals met: 3 of 5
32. (increment c3)
   changed: (value c3) from 49 to 55
   goals met: 3 of 5
33. (increment c4)
   changed: (value c4) from 44 to 50
   goals met: 3 of 5
34. (increment c4)
   changed: (value c4) from 50 to 56
   goals met: 4 of 5
35. (increment c3)
   changed: (value c3) from 55 to 61
   goals met: 3 of 5
36. (increment c4)
   changed: (value c4) from 56 to 62
   goals met: 4 of 5
37. (decrement c2)
   changed: (value c2) from 62 to 59
   goals met: 5 of 5
